// Отвечает за настройку, запуск таймера, оркестрацию процесса и вывод результатов
package main

import (
	"flag"
	"fmt"
	"os"
	"time"
)

// Config хранит настройки, полученные из флагов командной строки
type Config struct {
	DirPath string        // Путь для сканирования
	Mode    string        // Режим: name_size, hash, combined
	Workers int           // Количество горутин
	Tick    time.Duration // Интервал обновления процесса
}

func main() {
	// 1. Парсинг флагов (настройка CLI)
	pathPtr := flag.String("path", ".", "Путь к директории для сканирования")
	modePtr := flag.String("mode", "hash", "Режим поиска: name_size (имя+размер), hash (содержимое), combined (имя+размер+хэш)")
	workersPtr := flag.Int("workers", 8, "Количество конкурентных воркеров для чтения файлов")
	tickPtr := flag.Duration("tick", 500*time.Millisecond, "Интервал обновления прогресса (например 500ms)")

	//Читаем аргументы
	flag.Parse()

	cfg := Config{
		DirPath: *pathPtr,
		Mode:    *modePtr,
		Workers: *workersPtr,
		Tick:    *tickPtr,
	}

	fmt.Printf("🚀 Запуск DupliFinder\n📂 Папка: %s\n⚙ Режим: %s\n👷‍♂️👷‍♀️ Воркеров: %d\n\n", cfg.DirPath, cfg.Mode, cfg.Workers)
	startTime := time.Now() // Засекаем время старта

	// 2. Инициализация сканера
	scanner := NewScanner(cfg)

	// Запускаем тикер для отображения прогресса в отдельной горутине
	// time.NewTicker создает канал, в который приходят сообщения каждые Х времени
	done := make(chan bool)
	ticker := time.NewTicker(cfg.Tick)
	go func() {
		for {
			select {
			case <-done: // Если получили сигнал завершения - выходим
				return
			case <-ticker.C: // Каждое срабатывание тикера
				stats := scanner.GetStats()
				// \r возвращает каретку в начало строки, позволяя перезаписывать текст (эффект анимации)
				fmt.Printf("\r🔎 Просмотрено файлов: %d| Найдено групп дупликатов: %d | Ошибок: %d",
					stats.TotalFiles, stats.DuplicateGroups, stats.Errors)
			}
		}
	}()

	// 3. Основная работа (Блокирующая операция)
	duplicates, err := scanner.Run()

	// Останавливаем тикер и прогресс
	ticker.Stop()
	done <- true
	fmt.Println() // Перенос строки после прогресс-бара

	if err != nil {
		fmt.Printf("❌ Критическая ошибка: %v,\n", err)
		os.Exit(1)
	}

	// 4. Вывод пезультатов
	fmt.Println("\n📊 Результаты поиска:")
	if len(duplicates) == 0 {
		fmt.Println("Дубликаты не найдены")
	} else {
		for i, group := range duplicates {
			fmt.Printf("Группа #%d (Файлов %d)\n", i+1, len(group))
			for _, file := range group {
				fmt.Printf("  📄 %s (%d bytes)\n", file.Path, file.Size)
			}
			fmt.Println()
		}
	}

	fmt.Printf("\n⏱  Время выполнения: %s\n", time.Since(startTime))

}
